Revit 2027 API
ParameterTypeId.WallHeightType Property
 "Top Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallHeightType { get; }
Public Shared ReadOnly Property WallHeightType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallHeightType {
	ForgeTypeId^ get ();
}
static member WallHeightType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace